---
title: GridChainSketchFailures
classe: Autodesk.Revit.DB.BuiltInFailures+GridChainSketchFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# GridChainSketchFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId ClosedLoop { get; }` | `GridChainSketchFailures.ClosedLoop` | FailureDefinitionId |
| `FailureDefinitionId InvalidSketch { get; }` | `GridChainSketchFailures.InvalidSketch` | FailureDefinitionId |
| `FailureDefinitionId MoreThanOneLoop { get; }` | `GridChainSketchFailures.MoreThanOneLoop` | FailureDefinitionId |
| `FailureDefinitionId OverlappingLines { get; }` | `GridChainSketchFailures.OverlappingLines` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```